{
  "title": "Enterprise HRIS Platform",
  "category": "enterprise",
  "tech": ["Flutter", "Laravel", "MySQL", "Firebase", "REST API", "Docker"],
  "description": "Comprehensive human resource information system for enterprise-level employee management.",
  "image": "/projects/hris.jpg",
  "featured": true,
  "order": 1,

  "summary": "Comprehensive human resource information system handling employee management, attendance, payroll, and performance reviews for 5000+ users.",
  "role": "Lead Mobile Developer",
  "timeline": "Jan 2023 - Present",
  "liveUrl": "https://example.com",
  "repoUrl": "https://github.com/ridwanfar",

  "challenges": [
    {
      "challenge": "Offline-First Architecture",
      "solution": "Implemented SQLite local storage with intelligent sync queue and conflict resolution algorithms to ensure data integrity even in low-connectivity scenarios."
    },
    {
      "challenge": "Real-time Attendance Tracking",
      "solution": "Built a GPS-based attendance system with geofencing and anti-spoofing measures, integrating with biometric authentication for enhanced security."
    },
    {
      "challenge": "Complex Role-Based Access",
      "solution": "Designed a flexible RBAC system supporting hierarchical permissions, allowing granular access control across departments and management levels."
    },
    {
      "challenge": "Performance at Scale",
      "solution": "Optimized database queries and implemented lazy loading with pagination, reducing initial load time by 60% for users managing large datasets."
    }
  ],

  "impactMetrics": [
    { "label": "Active Users", "value": "5,000+" },
    { "label": "Performance Improvement", "value": "+60%" },
    { "label": "Offline Reliability", "value": "99.9%" },
    { "label": "User Satisfaction", "value": "4.8/5" }
  ],

  "outcome": "The HRIS platform has been successfully deployed across all company locations, significantly reducing HR administrative overhead by 40% and improving employee self-service adoption rates. The mobile-first approach enabled field workers to access HR services seamlessly, even in areas with limited connectivity."
}
